# Install command-line tools using Homebrew
# Usage: `brew bundle Brewfile`

tap "brewsci/science"
tap "gapple/services"
tap "ebeigarts/homebrew-magic-lantern"

# Make sure we’re using the latest Homebrew
#brew update

# Upgrade any already-installed formulae
#brew upgrade

# Install packages
brew "ack"
brew "aspell"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "cabextract"
brew "cloc"
brew "cmake"
brew "colordiff"
brew "curl"
brew "fig"
brew "gawk"
brew "gdbm"
brew "gist"
brew "git"
brew "gnu-sed"
brew "gnutls"
brew "go"
brew "graphviz"
brew "htop-osx"
brew "hub"
brew "iperf"
brew "isync"
brew "libxml2"
brew "libxslt"
brew "libyaml"
brew "lynx"
brew "mcrypt"
brew "media-info"
brew "memcache-top"
brew "mercurial"
brew "monit"
brew "mpssh"
brew "nginx"
brew "nmap"
brew "node"
brew "npm"
brew "parallel"
brew "phantomjs"
brew "pwgen"
brew "python"
brew "R"
brew "rename"
brew "rlwrap"
brew "tig"
brew "trash"
brew "tree"
brew "unrar"
brew "watch"
brew "wget"

# Install databases and search engines
# brew "elasticsearch"
brew "memcached"
brew "mongodb"
brew "mysql"
brew "freetds"
brew "redis"
brew "sqlite"
brew "postgresql"
brew "postgis"
brew "proj"
brew "gdal"
brew "geos"
brew "mdbtools"

# Install image processing packages
brew "imagemagick"
brew "exiftool"
brew "ufraw"
brew "jpegoptim"
brew "optipng"
brew "librsvg"

# Install video packages
brew "mediainfo"
brew "ffmpeg"
brew "gpac"
brew "mkvtoolnix"
brew "mplayer"

# Install extra filesystems support (NOT WORKING)
# brew osxfuse
# brew ext4fuse

# Remove outdated versions from the cellar
# cleanup
